app/Controllers/carrito_controller.php

   public function agregar($id = null)
{
    $productoModel = new producto_model();
    $producto = $productoModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '3'

   public function comprar()
{
    $cartItems = $this->cart->contents();

    if (empty($cartItems)) {
        return redirect()->back()->with('mensaje', 'El carrito está vacío.');
    }

    $cabeceraModel = new Ventas_cabecera_model();
    $detalleModel  = new Ventas_detalle_model();

    $id_usuario = $this->session->get('id_usuario');
    $total      = $this->cart->total();


    $venta_id = $cabeceraModel->insertarCabecera($id_usuario, $total);


    foreach ($cartItems as $item) {
        if (!isset($item['id'])) {
            continue;
        }

        $detalleModel->insert([
            'venta_id'    => $venta_id,
            'producto_id' => $item['id'],
            'cantidad'    => $item['qty'],
            'precio'      => $item['price'],
        ]);
---
INSERT INTO `ventas_detalle` (`venta_id`, `producto_id`, `cantidad`, `precio`) VALUES (18, '5', 1, 600000)