app/Controllers/Home.php

    public function tienda_view()
{
    $productoModel = new \App\Models\producto_model();
    $data['titulo'] = 'Tienda | Style Smash';

    // Trae solo los productos NO eliminados
    $productos = $productoModel->where('eliminado', 'NO')->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'