app/Controllers/producto_controller.php

        ];
    }

    $productoModel->update($id, $data);
---
UPDATE `productos` SET `nombre_prod` = 'producto prueba', `categoria_id` = '1234', `precio` = '1.00', `precio_vta` = '1.00', `stock` = '1', `stock_min` = '1'
WHERE `productos`.`id` IN ('19')