app/Controllers/producto_controller.php

SELECT *
FROM `productos`
WHERE `id` = '1'
 LIMIT 1
---
    public function singleproducto($id = null){
        $productoModel = new producto_model();
        $data['producto'] = $productoModel->where('id', $id)->first();

UPDATE `productos` SET `nombre_prod` = 'Pelotas Adidas', `categoria_id` = '1263', `precio` = '40000.00', `precio_vta` = '80000.00', `stock` = '6', `stock_min` = '3'
WHERE `productos`.`id` IN ('4')
---
    public function modifica($id){
        $productoModel = new producto_model();
        $img = $this->request->getFile('imagen');

        if ($img && $img->isValid() && !$img->hasMoved()) {
            $nombre_original = $img->getClientName();
            $img->move(ROOTPATH . 'public/assets/img', $nombre_original);

            $data = [
                'nombre_prod'   => $this->request->getVar('nombre_prod'),
                'imagen'        => $nombre_original,
                'categoria_id'  => $this->request->getVar('categoria'),
                'precio'        => $this->request->getVar('precio'),
                'precio_vta'    => $this->request->getVar('precio_vta'),
                'stock'         => $this->request->getVar('stock'),
                'stock_min'     => $this->request->getVar('stock_min'),
            ];
        } else {
            $data = [
                'nombre_prod'   => $this->request->getVar('nombre_prod'),
                'categoria_id'  => $this->request->getVar('categoria'),
                'precio'        => $this->request->getVar('precio'),
                'precio_vta'    => $this->request->getVar('precio_vta'),
                'stock'         => $this->request->getVar('stock'),
                'stock_min'     => $this->request->getVar('stock_min'),
            ];
        }

        $productoModel->update($id, $data);