app/Controllers/Usuario_controller.php

SELECT `usuario`.*, `perfiles`.`descripcion` AS `perfil`
FROM `usuario`
JOIN `perfiles` ON `perfiles`.`id_perfil` = `usuario`.`id_perfil`
WHERE `usuario`.`baja` = 'NO'
---
        public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('usuario');
        $builder->select('usuario.*, perfiles.descripcion AS perfil');
        $builder->join('perfiles', 'perfiles.id_perfil = usuario.id_perfil');
        $builder->where('usuario.baja', 'NO');
        $query = $builder->get();

SELECT `usuario`.*, `perfiles`.`descripcion` AS `perfil`
FROM `usuario`
JOIN `perfiles` ON `perfiles`.`id_perfil` = `usuario`.`id_perfil`
WHERE `usuario`.`baja` = 'SI'
---
    public function usuarios_baja()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('usuario');
        $builder->select('usuario.*, perfiles.descripcion AS perfil');
        $builder->join('perfiles', 'perfiles.id_perfil = usuario.id_perfil');
        $builder->where('usuario.baja', 'SI');
        $query = $builder->get();