app/Controllers/VentasController.php

    public function index()
    {
        $cabeceraModel = new ventas_cabecera_model();
        $db = \Config\Database::connect();
        $builder = $db->table('ventas_cabecera');
        $builder->select('ventas_cabecera.*, usuario.nombre, usuario.apellido');
        $builder->join('usuario', 'usuario.id_usuario = ventas_cabecera.id_usuario');
        $query = $builder->get();
---
SELECT `ventas_cabecera`.*, `usuario`.`nombre`, `usuario`.`apellido`
FROM `ventas_cabecera`
JOIN `usuario` ON `usuario`.`id_usuario` = `ventas_cabecera`.`id_usuario`