app/Models/categorias_model.php

SELECT *
FROM `categorias`
WHERE `activo` = '1'
---
    public function getCategorias()
    {
        return $this->where('activo', '1' )->findAll();