app/Models/Consulta_model.php

SELECT *
FROM `consulta`
ORDER BY `id_consulta` DESC
---
    public function getConsultas()
    {
        return $this->orderBy('id_consulta', 'DESC')->findAll();

UPDATE `consulta` SET `respuesta` = 'SI'
WHERE `consulta`.`id_consulta` IN ('4')
---
    public function atender($id)
    {
        return $this->update($id, ['respuesta' => 'SI']);