app/Models/producto_model.php

    public function getProductoAll()
    {
        return $this->where('eliminado', 'NO')->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'