app/Models/ventas_cabecera_model.php

    public function insertarCabecera($id_usuario, $total)
    {
        $data = [
            'id_usuario' => $id_usuario,
            'fecha'      => date('Y-m-d H:i:s'),
            'total_venta'      => $total
        ];

        $this->insert($data);
---
INSERT INTO `ventas_cabecera` (`id_usuario`, `fecha`, `total_venta`) VALUES ('3', '2025-06-18 03:53:24', 1230000)